
##############################################################################################################################################################################@
#   وهو تطبيق بسيط عبارة عن اختصار الروابط مع بعض المميزات تحويل الوقت او عدد محدد لاستخدام الرابط او وضع كلمة مرور M3fooos تم انشاء التطبيق من قبل                  @
#   وهو تطبيق بسيط جدا جدا ولكن هدفي هو ليس التطبيق ذاته او ربما لا تستخدمة في موقعك ولكن الهدف هو إيصال معلومة بان المبرمج ليس بالاكواد ولكن البرمجة الحقيقية       @
#   هو العقل الذي هو كيف يبني مخطط او خطة لعمل النظام وكيف يكون السيناريو لطريقة العمل من البداية الي النهائية                                                        @
#   وايضا انا تعمدة انني اكتب بهذه الصيغة لكي تصل غايتي وهي ان لكل شخص تفكير                                                                                            @
#   ووضعت ايضا بعض الطرق التي لديها بدائل كثيرة في كتابت الكود كي اضع لك بان تقدر تعملها بطرق اخر وتضيف حقول                                                         @
#   وتخفف الحقول وكيف لا تكرر الاكواد التي تتطلب في كل مرة تستخدمها وايضا تعمدة ايضا اضع شغلات مكررة كيف تفكر اكثر                                                     @
#   وايضا كتبت فوق كل سطر تقريباً ماذا يعمل, كي تعرف كيف نسير خطوة بخطوة                                                                                                 @
#   هذا العمل لوجة الله سبحانة وتعالى                                                                                                                                      @
#   لا اقبل ببيعه للاخرين .. فهو مجاني للجميع سواء استخدام شخصي او عام او تعديل او الدراسة منه                                                                            @
#   وهو موجة حق الاشخاص المبتدئين في جانغو وايضا موجة للاشخاص الذين يكتب الكود دون فهم ما يكتب او الذي لا ينظم الكود ويشربك الامور في بعضها البعض                       @
#   ويدخل في بعض المشاكل                                                                                                                                                    @
#   واخر الحديث الشكر لله دائما وأبداً                                                                                                                                     @
#   telegram اتواجد في                                                                                                                                                      @
#   @xking الحساب                                                                                                                                                           @
############################################################################################################################################################################@

from django.urls import path

#استدعاء الكلاس الفيو الي سوف نستخدمة في التطبيق  بالريندر العادي حق جانقو   
from .views import CreateRow , ShowRow , open_url

#اسم التطبيق هذ يجي مع الجانقو عندما تنشى تطبيق ويعتمد عليه جانقو لمعرفة المودل المقصود 
app_name = 'linksShortcut'

# هذا المتغير تكون فيه الروابط التابعة لهذا التطبيق 
urlpatterns =[
    #رابط انشاء  الفورما 
    path('Create/', CreateRow.as_view() ,name='CreateRow'),
    #رابط بعد اانشاء الرابط المختصر يستقبل الكود الذي تم انشائة ويعرض البيانات فيه 
    path('CreateShow/<str:code>', ShowRow.as_view() ,name='CreateShow'),


    #الرابط المختصر سوف نوجة الي فنكشن وبها خصائص ام تحويل دايركت او بالثواني على حسب اعدادتك في التطبيق
    path('<str:code>/', open_url ,name='open-url'),

            ]

#روابط  التمبلت 
# urlpatterns +=  url_templates

#api روابط
# urlpatterns +=  url_templates



